OpenFOAM/duct395/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (4 0 0)
    (0 1 0)
    (4 1 0)
    (0 2 0)
    (4 2 0)

    (0 0 2)
    (4 0 2)
    (0 1 2)
    (4 1 2)
    (0 2 2)
    (4 2 2)

    (0 0 1)
    (4 0 1)
    (0 1 1)
    (4 1 1)
    (0 2 1)
    (4 2 1)
);

blocks
(
    hex (0 1 3 2 12 13 15 14)   (60 36 36) simpleGrading (1 36 36)
    hex (2 3 5 4 14 15 17 16)   (60 36 36) simpleGrading (1 -36 36)
    hex (12 13 15 14 6 7 9 8)   (60 36 36) simpleGrading (1 36 -36)
    hex (14 15 17 16 8 9 11 10) (60 36 36) simpleGrading (1 -36 -36)
);

edges
(
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 13 12)(12 13 7 6));
    }
    topWall
    {
        type            wall;
        faces           ((4 16 17 5)(16 10 11 17));
    }

    sideWalls
    {
        type            wall;
        faces           ((0 1 3 2)(2 3 5 4)(6 7 9 8)(8 9 11 10));
    }

    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces           ((0 2 14 12)(2 4 16 14)(14 16 10 8)(12 14 8 6));
    }
    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        //faces           ((7 9 15 13)(9 11 17 15)(15 17 5 3)(13 15 3 1));
        
        faces           ((1 3 15 13)(3 5 17 15)(15 17 11 9)(13 15 9 7));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
