OpenFOAM/duct395/system/turbulenceFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");
writeControl    writeTime;

fields          (R devReff);

// ************************************************************************* //
